app/controllers/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "date", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "play ball"], ["date", "2017-06-06"], ["note", "play baseball"], ["created_at", "2017-11-11 15:58:22.424375"], ["updated_at", "2017-11-11 15:58:22.424375"]]

  def update
    set_todo
    if @todo.update_attributes(todo_params)
---
UPDATE "todos" SET "note" = ?, "updated_at" = ? WHERE "todos"."id" = ?